antfu.icons-carbon
astro-build.astro-vscode
catppuccin.catppuccin-vsc-icons
charliermarsh.ruff
docker.docker
dracula-theme.theme-dracula
esbenp.prettier-vscode
github.copilot
github.copilot-chat
mechatroner.rainbow-csv
monokai.theme-monokai-pro-vscode
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-dotnettools.csdevkit
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-pyright.pyright
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode.remote-explorer
saoudrizwan.claude-dev
tushortz.python-extended-snippets
